<?php
$json = '[ { "交易日期":"103.06.25","作物代號":"11","作物名稱":"椰子","市場代號":"241","市場名稱":"三重市","上價":"11","中價":"9.2","下價":"7.9","平均價":"9.3","交易量":"12335"}, { "交易日期":"103.06.25","作物代號":"12","作物名稱":"椰子-剝殼","市場代號":"241","市場名稱":"三重市","上價":"25","中價":"25","下價":"25","平均價":"25","交易量":"80"}, { "交易日期":"103.06.25","作物代號":"51","作物名稱":"百香果-改良種","市場代號":"241","市場名稱":"三重市","上價":"57.3","中價":"31.9","下價":"24.6","平均價":"35.5","交易量":"1535"}, { "交易日期":"103.06.25","作物代號":"61","作物名稱":"甘蔗-帶皮","市場代號":"241","市場名稱":"三重市","上價":"8","中價":"8","下價":"8","平均價":"8","交易量":"960"}, { "交易日期":"103.06.25","作物代號":"70","作物名稱":"小番茄-其他","市場代號":"241","市場名稱":"三重市","上價":"25","中價":"21.6","下價":"20","平均價":"22","交易量":"3860"}, { "交易日期":"103.06.25","作物代號":"71","作物名稱":"小番茄-一般","市場代號":"241","市場名稱":"三重市","上價":"34.4","中價":"21.8","下價":"19","平均價":"23.7","交易量":"3642"}, { "交易日期":"103.06.25","作物代號":"74","作物名稱":"小番茄-玉女","市場代號":"241","市場名稱":"三重市","上價":"65.5","中價":"33.8","下價":"20.2","平均價":"37.4","交易量":"1012"}, { "交易日期":"103.06.25","作物代號":"811","作物名稱":"火龍果-白肉","市場代號":"241","市場名稱":"三重市","上價":"68.6","中價":"44","下價":"28.3","平均價":"45.8","交易量":"12057"}, { "交易日期":"103.06.25","作物代號":"812","作物名稱":"火龍果-紅肉","市場代號":"241","市場名稱":"三重市","上價":"54.7","中價":"33.9","下價":"25.4","平均價":"36.4","交易量":"24707"}, { "交易日期":"103.06.25","作物代號":"839","作物名稱":"櫻桃-進口","市場代號":"241","市場名稱":"三重市","上價":"347.7","中價":"265.3","下價":"239.6","平均價":"276.7","交易量":"10732"}, { "交易日期":"103.06.25","作物代號":"859","作物名稱":"榴槤-進口","市場代號":"241","市場名稱":"三重市","上價":"58.3","中價":"58.3","下價":"58.3","平均價":"58.3","交易量":"7560"}, { "交易日期":"103.06.25","作物代號":"91","作物名稱":"其他","市場代號":"241","市場名稱":"三重市","上價":"45.7","中價":"25","下價":"16.3","平均價":"27.4","交易量":"544"}, { "交易日期":"103.06.25","作物代號":"919","作物名稱":"其他-進口","市場代號":"241","市場名稱":"三重市","上價":"180","中價":"180","下價":"180","平均價":"180","交易量":"20"}, { "交易日期":"103.06.25","作物代號":"A1","作物名稱":"香蕉","市場代號":"241","市場名稱":"三重市","上價":"27.1","中價":"25","下價":"21","平均價":"24.6","交易量":"17075"}, { "交易日期":"103.06.25","作物代號":"A2","作物名稱":"香蕉-芭蕉","市場代號":"241","市場名稱":"三重市","上價":"46","中價":"24.5","下價":"13.7","平均價":"26.6","交易量":"5724"}, { "交易日期":"103.06.25","作物代號":"A3","作物名稱":"香蕉-旦蕉","市場代號":"241","市場名稱":"三重市","上價":"39.4","中價":"32.8","下價":"26.5","平均價":"32.9","交易量":"1119"}, { "交易日期":"103.06.25","作物代號":"B0","作物名稱":"鳳梨-其他","市場代號":"241","市場名稱":"三重市","上價":"37.9","中價":"26","下價":"6.5","平均價":"24.5","交易量":"1248"}, { "交易日期":"103.06.25","作物代號":"B2","作物名稱":"鳳梨-金鑽鳳梨","市場代號":"241","市場名稱":"三重市","上價":"28.6","中價":"15.1","下價":"11.9","平均價":"17.1","交易量":"60556"}, { "交易日期":"103.06.25","作物代號":"B6","作物名稱":"鳳梨-甜蜜蜜","市場代號":"241","市場名稱":"三重市","上價":"12","中價":"10.4","下價":"10","平均價":"10.6","交易量":"11283"}, { "交易日期":"103.06.25","作物代號":"B7","作物名稱":"鳳梨-牛奶鳳梨","市場代號":"241","市場名稱":"三重市","上價":"14","中價":"13","下價":"12","平均價":"13","交易量":"600"}, { "交易日期":"103.06.25","作物代號":"E9","作物名稱":"甜橙-進口","市場代號":"241","市場名稱":"三重市","上價":"45","中價":"45","下價":"45","平均價":"45","交易量":"3520"}, { "交易日期":"103.06.25","作物代號":"F1","作物名稱":"檸檬-檸檬","市場代號":"241","市場名稱":"三重市","上價":"56.4","中價":"36.5","下價":"27.5","平均價":"38.7","交易量":"3685"}, { "交易日期":"103.06.25","作物代號":"F4","作物名稱":"雜柑-桔子","市場代號":"241","市場名稱":"三重市","上價":"30.9","中價":"22.8","下價":"18.5","平均價":"23.5","交易量":"735"}, { "交易日期":"103.06.25","作物代號":"F5","作物名稱":"雜柑-無子檸檬","市場代號":"241","市場名稱":"三重市","上價":"53.1","中價":"40.9","下價":"28.3","平均價":"40.8","交易量":"6238"}, { "交易日期":"103.06.25","作物代號":"FA1","作物名稱":"黃秋葵","市場代號":"241","市場名稱":"三重市","上價":"57.3","中價":"42","下價":"17.5","平均價":"40.2","交易量":"962.5"}, { "交易日期":"103.06.25","作物代號":"FB1","作物名稱":"花椰菜-青梗","市場代號":"241","市場名稱":"三重市","上價":"3","中價":"3","下價":"3","平均價":"3","交易量":"22"}, { "交易日期":"103.06.25","作物代號":"FC1","作物名稱":"胡瓜-黑刺","市場代號":"241","市場名稱":"三重市","上價":"18","中價":"8","下價":"5.3","平均價":"9.5","交易量":"3489"}, { "交易日期":"103.06.25","作物代號":"FD1","作物名稱":"花胡瓜","市場代號":"241","市場名稱":"三重市","上價":"26.8","中價":"15.9","下價":"8.5","平均價":"16.6","交易量":"4316"}, { "交易日期":"103.06.25","作物代號":"FE1","作物名稱":"冬瓜-白皮","市場代號":"241","市場名稱":"三重市","上價":"10.2","中價":"8.1","下價":"7.1","平均價":"8.3","交易量":"1237"}, { "交易日期":"103.06.25","作物代號":"FF1","作物名稱":"絲瓜-絲瓜","市場代號":"241","市場名稱":"三重市","上價":"20.8","中價":"15.5","下價":"9.8","平均價":"15.5","交易量":"7536"}, { "交易日期":"103.06.25","作物代號":"FF2","作物名稱":"絲瓜-角瓜","市場代號":"241","市場名稱":"三重市","上價":"22.5","中價":"19.8","下價":"17.4","平均價":"19.8","交易量":"605"}, { "交易日期":"103.06.25","作物代號":"FF4","作物名稱":"絲瓜-長絲瓜","市場代號":"241","市場名稱":"三重市","上價":"24","中價":"22","下價":"18","平均價":"21.6","交易量":"122"}, { "交易日期":"103.06.25","作物代號":"FG1","作物名稱":"苦瓜-白大米","市場代號":"241","市場名稱":"三重市","上價":"22.9","中價":"17.6","下價":"8.6","平均價":"16.9","交易量":"2930"}, { "交易日期":"103.06.25","作物代號":"FG2","作物名稱":"苦瓜-青大米","市場代號":"241","市場名稱":"三重市","上價":"19.4","中價":"16.2","下價":"11","平均價":"15.8","交易量":"1803"}, { "交易日期":"103.06.25","作物代號":"FG3","作物名稱":"苦瓜-山苦瓜","市場代號":"241","市場名稱":"三重市","上價":"18","中價":"18","下價":"18","平均價":"18","交易量":"60"}, { "交易日期":"103.06.25","作物代號":"FG4","作物名稱":"苦瓜-翠綠","市場代號":"241","市場名稱":"三重市","上價":"14.6","中價":"11.7","下價":"7.3","平均價":"11.4","交易量":"632"}, { "交易日期":"103.06.25","作物代號":"FH3","作物名稱":"扁蒲-花蒲","市場代號":"241","市場名稱":"三重市","上價":"8.4","中價":"6.4","下價":"5","平均價":"6.5","交易量":"1217"}, { "交易日期":"103.06.25","作物代號":"FH4","作物名稱":"扁蒲-梨子蒲","市場代號":"241","市場名稱":"三重市","上價":"12.1","中價":"8.3","下價":"4.9","平均價":"8.4","交易量":"1855"}, { "交易日期":"103.06.25","作物代號":"FI0","作物名稱":"茄子-其他","市場代號":"241","市場名稱":"三重市","上價":"20","中價":"20","下價":"20","平均價":"20","交易量":"36"}, { "交易日期":"103.06.25","作物代號":"FI2","作物名稱":"茄子-麻荸茄","市場代號":"241","市場名稱":"三重市","上價":"25.8","中價":"14.2","下價":"6.2","平均價":"14.9","交易量":"3483"}, { "交易日期":"103.06.25","作物代號":"FI3","作物名稱":"茄子-日本種","市場代號":"241","市場名稱":"三重市","上價":"12","中價":"10","下價":"10","平均價":"10.4","交易量":"29"}, { "交易日期":"103.06.25","作物代號":"FJ1","作物名稱":"蕃茄-黑柿","市場代號":"241","市場名稱":"三重市","上價":"27.8","中價":"16.9","下價":"2.6","平均價":"16.3","交易量":"915"}, { "交易日期":"103.06.25","作物代號":"FJ3","作物名稱":"蕃茄-牛蕃茄","市場代號":"241","市場名稱":"三重市","上價":"26.4","中價":"17.1","下價":"9.4","平均價":"17.4","交易量":"4966"}, { "交易日期":"103.06.25","作物代號":"FK4","作物名稱":"甜椒-彩色種","市場代號":"241","市場名稱":"三重市","上價":"28.1","中價":"25.4","下價":"18.2","平均價":"24.5","交易量":"336"}, { "交易日期":"103.06.25","作物代號":"FK5","作物名稱":"甜椒-青椒","市場代號":"241","市場名稱":"三重市","上價":"35.5","中價":"18.3","下價":"5.8","平均價":"19.2","交易量":"882"}, { "交易日期":"103.06.25","作物代號":"FM1","作物名稱":"菜豆-白色","市場代號":"241","市場名稱":"三重市","上價":"22","中價":"18.9","下價":"13","平均價":"18.3","交易量":"99"}, { "交易日期":"103.06.25","作物代號":"FM2","作物名稱":"菜豆-青色","市場代號":"241","市場名稱":"三重市","上價":"24.5","中價":"14.8","下價":"8.4","平均價":"15.4","交易量":"1375"}, { "交易日期":"103.06.25","作物代號":"FM3","作物名稱":"菜豆-紅色","市場代號":"241","市場名稱":"三重市","上價":"18.8","中價":"13.9","下價":"5.3","平均價":"13.1","交易量":"320"}, { "交易日期":"103.06.25","作物代號":"FN1","作物名稱":"敏豆-白豆","市場代號":"241","市場名稱":"三重市","上價":"93.9","中價":"60.6","下價":"25.5","平均價":"60.2","交易量":"449"}, { "交易日期":"103.06.25","作物代號":"FN5","作物名稱":"敏豆-醜豆","市場代號":"241","市場名稱":"三重市","上價":"35","中價":"35","下價":"35","平均價":"35","交易量":"24"}, { "交易日期":"103.06.25","作物代號":"FT1","作物名稱":"南瓜-木瓜形","市場代號":"241","市場名稱":"三重市","上價":"15.5","中價":"12.3","下價":"8.5","平均價":"12.2","交易量":"1624"}, { "交易日期":"103.06.25","作物代號":"FT6","作物名稱":"南瓜-東昇","市場代號":"241","市場名稱":"三重市","上價":"20","中價":"18.2","下價":"17","平均價":"18.3","交易量":"140"}, { "交易日期":"103.06.25","作物代號":"FT7","作物名稱":"南瓜-栗子","市場代號":"241","市場名稱":"三重市","上價":"20","中價":"16.1","下價":"15","平均價":"16.7","交易量":"60"}, { "交易日期":"103.06.25","作物代號":"FU1","作物名稱":"隼人瓜","市場代號":"241","市場名稱":"三重市","上價":"10","中價":"10","下價":"10","平均價":"10","交易量":"167"}, { "交易日期":"103.06.25","作物代號":"FU3","作物名稱":"石蓮花","市場代號":"241","市場名稱":"三重市","上價":"8","中價":"7.5","下價":"7","平均價":"7.5","交易量":"120"}, { "交易日期":"103.06.25","作物代號":"FV0","作物名稱":"辣椒-其他","市場代號":"241","市場名稱":"三重市","上價":"60","中價":"48","下價":"35","平均價":"47.8","交易量":"34"}, { "交易日期":"103.06.25","作物代號":"FV1","作物名稱":"辣椒-紅小","市場代號":"241","市場名稱":"三重市","上價":"23.8","中價":"9.6","下價":"7","平均價":"11.9","交易量":"269"}, { "交易日期":"103.06.25","作物代號":"FV2","作物名稱":"辣椒-青小","市場代號":"241","市場名稱":"三重市","上價":"8","中價":"7.9","下價":"5","平均價":"7.4","交易量":"23"}, { "交易日期":"103.06.25","作物代號":"FV4","作物名稱":"辣椒-朝天椒","市場代號":"241","市場名稱":"三重市","上價":"41","中價":"22.4","下價":"14.3","平均價":"24.5","交易量":"128"}, { "交易日期":"103.06.25","作物代號":"FV5","作物名稱":"辣椒-青龍","市場代號":"241","市場名稱":"三重市","上價":"25","中價":"16.2","下價":"15","平均價":"17.7","交易量":"48"}, { "交易日期":"103.06.25","作物代號":"FV6","作物名稱":"辣椒-糯米椒","市場代號":"241","市場名稱":"三重市","上價":"53.6","中價":"38.1","下價":"19.5","平均價":"37.5","交易量":"93"}, { "交易日期":"103.06.25","作物代號":"FY0","作物名稱":"玉米-其他","市場代號":"241","市場名稱":"三重市","上價":"15","中價":"15","下價":"15","平均價":"15","交易量":"160"}, { "交易日期":"103.06.25","作物代號":"FY1","作物名稱":"玉米-白玉米","市場代號":"241","市場名稱":"三重市","上價":"12","中價":"12","下價":"12","平均價":"12","交易量":"195"}, { "交易日期":"103.06.25","作物代號":"FY2","作物名稱":"玉米-甜硬殼","市場代號":"241","市場名稱":"三重市","上價":"12","中價":"12","下價":"12","平均價":"12","交易量":"240"}, { "交易日期":"103.06.25","作物代號":"FY4","作物名稱":"玉米-玉米筍","市場代號":"241","市場名稱":"三重市","上價":"25.7","中價":"15.6","下價":"9.3","平均價":"16.4","交易量":"558"}, { "交易日期":"103.06.25","作物代號":"FY6","作物名稱":"玉米-甜軟殼","市場代號":"241","市場名稱":"三重市","上價":"20","中價":"10.7","下價":"3.8","平均價":"11.2","交易量":"240"}, { "交易日期":"103.06.25","作物代號":"FY7","作物名稱":"玉米-糯米(白)","市場代號":"241","市場名稱":"三重市","上價":"10.6","中價":"7.8","下價":"5","平均價":"7.8","交易量":"360"}, { "交易日期":"103.06.25","作物代號":"FZ1","作物名稱":"落花生-生落花生","市場代號":"241","市場名稱":"三重市","上價":"35","中價":"34.1","下價":"30","平均價":"33.5","交易量":"26"}, { "交易日期":"103.06.25","作物代號":"G1","作物名稱":"蛋黃果-仙桃","市場代號":"241","市場名稱":"三重市","上價":"15","中價":"15","下價":"15","平均價":"15","交易量":"36"}, { "交易日期":"103.06.25","作物代號":"G2","作物名稱":"黃金果","市場代號":"241","市場名稱":"三重市","上價":"30","中價":"30","下價":"30","平均價":"30","交易量":"24"}, { "交易日期":"103.06.25","作物代號":"G3","作物名稱":"酪梨","市場代號":"241","市場名稱":"三重市","上價":"58.9","中價":"46.9","下價":"43","平均價":"48.5","交易量":"1413"}, { "交易日期":"103.06.25","作物代號":"G49","作物名稱":"奇異果-進口","市場代號":"241","市場名稱":"三重市","上價":"130","中價":"121.9","下價":"89.6","平均價":"117","交易量":"5135"}, { "交易日期":"103.06.25","作物代號":"G5","作物名稱":"香瓜梨","市場代號":"241","市場名稱":"三重市","上價":"30","中價":"30","下價":"30","平均價":"30","交易量":"50"}, { "交易日期":"103.06.25","作物代號":"G9","作物名稱":"波羅蜜","市場代號":"241","市場名稱":"三重市","上價":"18.5","中價":"10.7","下價":"10","平均價":"12.1","交易量":"235"}, { "交易日期":"103.06.25","作物代號":"H4","作物名稱":"葡萄柚-紅肉","市場代號":"241","市場名稱":"三重市","上價":"15","中價":"15","下價":"15","平均價":"15","交易量":"672"}, { "交易日期":"103.06.25","作物代號":"H49","作物名稱":"葡萄柚-進口紅肉","市場代號":"241","市場名稱":"三重市","上價":"27.5","中價":"27.5","下價":"27.5","平均價":"27.5","交易量":"2540"}, { "交易日期":"103.06.25","作物代號":"I0","作物名稱":"木瓜-其他","市場代號":"241","市場名稱":"三重市","上價":"14.9","中價":"10.6","下價":"9.5","平均價":"11.2","交易量":"584"}, { "交易日期":"103.06.25","作物代號":"I1","作物名稱":"木瓜-網室紅肉","市場代號":"241","市場名稱":"三重市","上價":"31.8","中價":"21.4","下價":"16.8","平均價":"22.6","交易量":"22291"}, { "交易日期":"103.06.25","作物代號":"I3","作物名稱":"木瓜-日昇種","市場代號":"241","市場名稱":"三重市","上價":"36.8","中價":"29.7","下價":"27","平均價":"30.6","交易量":"1852"}, { "交易日期":"103.06.25","作物代號":"I4","作物名稱":"木瓜-青木瓜","市場代號":"241","市場名稱":"三重市","上價":"18.3","中價":"11.9","下價":"7.4","平均價":"12.3","交易量":"710"}, { "交易日期":"103.06.25","作物代號":"J0","作物名稱":"荔枝-其他","市場代號":"241","市場名稱":"三重市","上價":"65","中價":"30.6","下價":"30","平均價":"37.4","交易量":"38"}, { "交易日期":"103.06.25","作物代號":"J1","作物名稱":"荔枝-玉荷包","市場代號":"241","市場名稱":"三重市","上價":"34.7","中價":"30","下價":"25.6","平均價":"30.1","交易量":"472"}, { "交易日期":"103.06.25","作物代號":"J2","作物名稱":"荔枝-黑葉","市場代號":"241","市場名稱":"三重市","上價":"23.3","中價":"18.7","下價":"17.5","平均價":"19.4","交易量":"53914"}, { "交易日期":"103.06.25","作物代號":"J3","作物名稱":"荔枝-糯米","市場代號":"241","市場名稱":"三重市","上價":"47.2","中價":"35.5","下價":"27.7","平均價":"36.2","交易量":"3043"}, { "交易日期":"103.06.25","作物代號":"J4","作物名稱":"荔枝-竹葉黑","市場代號":"241","市場名稱":"三重市","上價":"30","中價":"22.6","下價":"20.2","平均價":"23.6","交易量":"3531"}, { "交易日期":"103.06.25","作物代號":"J5","作物名稱":"荔枝-桂味","市場代號":"241","市場名稱":"三重市","上價":"35","中價":"35","下價":"35","平均價":"35","交易量":"75"}, { "交易日期":"103.06.25","作物代號":"K41","作物名稱":"龍眼-龍眼肉","市場代號":"241","市場名稱":"三重市","上價":"140","中價":"140","下價":"140","平均價":"140","交易量":"12"}, { "交易日期":"103.06.25","作物代號":"LA1","作物名稱":"甘藍-初秋","市場代號":"241","市場名稱":"三重市","上價":"19.8","中價":"12.4","下價":"8","平均價":"13","交易量":"13010"}, { "交易日期":"103.06.25","作物代號":"LA2","作物名稱":"甘藍-改良種","市場代號":"241","市場名稱":"三重市","上價":"8","中價":"8","下價":"7.5","平均價":"7.9","交易量":"3100"}, { "交易日期":"103.06.25","作物代號":"LA9","作物名稱":"甘藍-進口","市場代號":"241","市場名稱":"三重市","上價":"3.5","中價":"3.5","下價":"3.5","平均價":"3.5","交易量":"500"}, { "交易日期":"103.06.25","作物代號":"LB1","作物名稱":"小白菜-土白菜","市場代號":"241","市場名稱":"三重市","上價":"25","中價":"21","下價":"14","平均價":"20.4","交易量":"475"}, { "交易日期":"103.06.25","作物代號":"LB2","作物名稱":"小白菜-蚵仔白","市場代號":"241","市場名稱":"三重市","上價":"25","中價":"21.2","下價":"14","平均價":"20.5","交易量":"360"}, { "交易日期":"103.06.25","作物代號":"LC1","作物名稱":"包心白菜-包白","市場代號":"241","市場名稱":"三重市","上價":"23.3","中價":"20","下價":"20","平均價":"20.7","交易量":"1200"}, { "交易日期":"103.06.25","作物代號":"LC9","作物名稱":"包心白-進口","市場代號":"241","市場名稱":"三重市","上價":"15","中價":"15","下價":"15","平均價":"15","交易量":"150"}, { "交易日期":"103.06.25","作物代號":"LD1","作物名稱":"青江白菜-小梗","市場代號":"241","市場名稱":"三重市","上價":"29","中價":"23.2","下價":"12","平均價":"22.1","交易量":"1680"}, { "交易日期":"103.06.25","作物代號":"LE1","作物名稱":"皇宮菜-小葉","市場代號":"241","市場名稱":"三重市","上價":"25.6","中價":"23","下價":"13.6","平均價":"21.7","交易量":"677"}, { "交易日期":"103.06.25","作物代號":"LE2","作物名稱":"皇宮菜-大葉","市場代號":"241","市場名稱":"三重市","上價":"7","中價":"5.7","下價":"4","平均價":"5.6","交易量":"54"}, { "交易日期":"103.06.25","作物代號":"LF1","作物名稱":"蕹菜-大葉","市場代號":"241","市場名稱":"三重市","上價":"10","中價":"10","下價":"10","平均價":"10","交易量":"60"}, { "交易日期":"103.06.25","作物代號":"LF2","作物名稱":"蕹菜-小葉","市場代號":"241","市場名稱":"三重市","上價":"27.5","中價":"20.8","下價":"16.2","平均價":"21.2","交易量":"2553"}, { "交易日期":"103.06.25","作物代號":"LG2","作物名稱":"芹菜-白梗","市場代號":"241","市場名稱":"三重市","上價":"17","中價":"17","下價":"17","平均價":"17","交易量":"240"}, { "交易日期":"103.06.25","作物代號":"LH2","作物名稱":"菠菜-角葉","市場代號":"241","市場名稱":"三重市","上價":"35","中價":"33.9","下價":"21.7","平均價":"31.7","交易量":"180"}, { "交易日期":"103.06.25","作物代號":"LI3","作物名稱":"萵苣菜-本島圓葉","市場代號":"241","市場名稱":"三重市","上價":"33.8","中價":"25.2","下價":"10","平均價":"23.9","交易量":"400"}, { "交易日期":"103.06.25","作物代號":"LI5","作物名稱":"萵苣菜-油麥菜","市場代號":"241","市場名稱":"三重市","上價":"42","中價":"25.6","下價":"12.7","平均價":"26.3","交易量":"951"}, { "交易日期":"103.06.25","作物代號":"LJ3","作物名稱":"芥菜-大芥菜","市場代號":"241","市場名稱":"三重市","上價":"3.5","中價":"3.5","下價":"3.5","平均價":"3.5","交易量":"40"}, { "交易日期":"103.06.25","作物代號":"LJ4","作物名稱":"芥菜-小芥菜","市場代號":"241","市場名稱":"三重市","上價":"28","中價":"28","下價":"28","平均價":"28","交易量":"240"}, { "交易日期":"103.06.25","作物代號":"LK2","作物名稱":"芥藍菜","市場代號":"241","市場名稱":"三重市","上價":"30","中價":"21.2","下價":"16","平均價":"21.9","交易量":"400"}, { "交易日期":"103.06.25","作物代號":"LM1","作物名稱":"莧菜-紅莧菜","市場代號":"241","市場名稱":"三重市","上價":"20.9","中價":"17.4","下價":"13.7","平均價":"17.4","交易量":"480"}, { "交易日期":"103.06.25","作物代號":"LM2","作物名稱":"莧菜-白莧菜","市場代號":"241","市場名稱":"三重市","上價":"22","中價":"19.4","下價":"12.6","平均價":"18.6","交易量":"860"}, { "交易日期":"103.06.25","作物代號":"LN1","作物名稱":"油菜","市場代號":"241","市場名稱":"三重市","上價":"20","中價":"17.8","下價":"12.3","平均價":"17.1","交易量":"440"}, { "交易日期":"103.06.25","作物代號":"LO1","作物名稱":"甘藷葉","市場代號":"241","市場名稱":"三重市","上價":"17.1","中價":"12.3","下價":"8.6","平均價":"12.5","交易量":"1957"}, { "交易日期":"103.06.25","作物代號":"LP2","作物名稱":"九層塔","市場代號":"241","市場名稱":"三重市","上價":"15.9","中價":"12.5","下價":"8.9","平均價":"12.4","交易量":"339"}, { "交易日期":"103.06.25","作物代號":"LQ1","作物名稱":"紅鳳菜-紅鳳菜","市場代號":"241","市場名稱":"三重市","上價":"27","中價":"18.6","下價":"12.1","平均價":"19","交易量":"141"}, { "交易日期":"103.06.25","作物代號":"LT3","作物名稱":"海菜-水蓮","市場代號":"241","市場名稱":"三重市","上價":"30","中價":"30","下價":"30","平均價":"30","交易量":"90"}, { "交易日期":"103.06.25","作物代號":"LY2","作物名稱":"黑甜仔菜","市場代號":"241","市場名稱":"三重市","上價":"5","中價":"5","下價":"5","平均價":"5","交易量":"18"}, { "交易日期":"103.06.25","作物代號":"M1","作物名稱":"楊桃-軟枝蜜絲","市場代號":"241","市場名稱":"三重市","上價":"15","中價":"15","下價":"15","平均價":"15","交易量":"26"}, { "交易日期":"103.06.25","作物代號":"MA1","作物名稱":"洋菇","市場代號":"241","市場名稱":"三重市","上價":"50","中價":"50","下價":"50","平均價":"50","交易量":"3"}, { "交易日期":"103.06.25","作物代號":"MC1","作物名稱":"濕木耳","市場代號":"241","市場名稱":"三重市","上價":"44.4","中價":"34.4","下價":"20.1","平均價":"33.5","交易量":"152"}, { "交易日期":"103.06.25","作物代號":"MD1","作物名稱":"溼香菇","市場代號":"241","市場名稱":"三重市","上價":"40","中價":"40","下價":"40","平均價":"40","交易量":"36"}, { "交易日期":"103.06.25","作物代號":"ME1","作物名稱":"金絲菇","市場代號":"241","市場名稱":"三重市","上價":"20","中價":"20","下價":"20","平均價":"20","交易量":"50"}, { "交易日期":"103.06.25","作物代號":"ME2","作物名稱":"金絲菇(盒)-盒裝","市場代號":"241","市場名稱":"三重市","上價":"6","中價":"6","下價":"6","平均價":"6","交易量":"400"}, { "交易日期":"103.06.25","作物代號":"MJ1","作物名稱":"杏鮑菇","市場代號":"241","市場名稱":"三重市","上價":"35","中價":"22.6","下價":"8","平均價":"22.2","交易量":"476"}, { "交易日期":"103.06.25","作物代號":"MK2","作物名稱":"鴻禧菇-盒裝","市場代號":"241","市場名稱":"三重市","上價":"18","中價":"18","下價":"18","平均價":"18","交易量":"168"}, { "交易日期":"103.06.25","作物代號":"ML1","作物名稱":"珊瑚菇","市場代號":"241","市場名稱":"三重市","上價":"25","中價":"22.3","下價":"18","平均價":"22","交易量":"42"}, { "交易日期":"103.06.25","作物代號":"MX1","作物名稱":"其他菇類-其他菇類","市場代號":"241","市場名稱":"三重市","上價":"42.6","中價":"18","下價":"18","平均價":"22.9","交易量":"193"}, { "交易日期":"103.06.25","作物代號":"N0","作物名稱":"李-其他","市場代號":"241","市場名稱":"三重市","上價":"18","中價":"14.6","下價":"12.5","平均價":"14.8","交易量":"3969"}, { "交易日期":"103.06.25","作物代號":"N3","作物名稱":"李-紅肉李","市場代號":"241","市場名稱":"三重市","上價":"18.7","中價":"13","下價":"12","平均價":"14","交易量":"1577"}, { "交易日期":"103.06.25","作物代號":"N5","作物名稱":"李-加州李","市場代號":"241","市場名稱":"三重市","上價":"10","中價":"10","下價":"10","平均價":"10","交易量":"96"}, { "交易日期":"103.06.25","作物代號":"N6","作物名稱":"李-泰安李","市場代號":"241","市場名稱":"三重市","上價":"30.6","中價":"20","下價":"14.8","平均價":"21.1","交易量":"1104"}, { "交易日期":"103.06.25","作物代號":"O0","作物名稱":"梨-其他","市場代號":"241","市場名稱":"三重市","上價":"15","中價":"15","下價":"12.8","平均價":"14.6","交易量":"60"}, { "交易日期":"103.06.25","作物代號":"O2","作物名稱":"梨-秋水梨","市場代號":"241","市場名稱":"三重市","上價":"34.2","中價":"28.6","下價":"27","平均價":"29.4","交易量":"4961"}, { "交易日期":"103.06.25","作物代號":"O4","作物名稱":"梨-新興梨","市場代號":"241","市場名稱":"三重市","上價":"31.3","中價":"30","下價":"29.1","平均價":"30.1","交易量":"4466"}, { "交易日期":"103.06.25","作物代號":"O5","作物名稱":"梨-豐水梨","市場代號":"241","市場名稱":"三重市","上價":"47.5","中價":"30.6","下價":"25.6","平均價":"33","交易量":"17746"}, { "交易日期":"103.06.25","作物代號":"O8","作物名稱":"梨-4029梨","市場代號":"241","市場名稱":"三重市","上價":"35","中價":"23.8","下價":"13.7","平均價":"24","交易量":"167"}, { "交易日期":"103.06.25","作物代號":"OG1","作物名稱":"熟筍-桂竹筍","市場代號":"241","市場名稱":"三重市","上價":"5","中價":"5","下價":"5","平均價":"5","交易量":"13"}, { "交易日期":"103.06.25","作物代號":"OI1","作物名稱":"筍乾","市場代號":"241","市場名稱":"三重市","上價":"20","中價":"20","下價":"20","平均價":"20","交易量":"9"}, { "交易日期":"103.06.25","作物代號":"OV","作物名稱":"梨-蜜梨","市場代號":"241","市場名稱":"三重市","上價":"32.7","中價":"31.1","下價":"23","平均價":"29.8","交易量":"4186"}, { "交易日期":"103.06.25","作物代號":"OX1","作物名稱":"其他蔬菜","市場代號":"241","市場名稱":"三重市","上價":"33.1","中價":"23.8","下價":"10","平均價":"22.9","交易量":"117"}, { "交易日期":"103.06.25","作物代號":"P1","作物名稱":"番石榴-珍珠芭","市場代號":"241","市場名稱":"三重市","上價":"32.1","中價":"19.5","下價":"15.1","平均價":"21.1","交易量":"47480"}, { "交易日期":"103.06.25","作物代號":"P2","作物名稱":"番石榴-紅心","市場代號":"241","市場名稱":"三重市","上價":"38","中價":"35.5","下價":"21","平均價":"33.1","交易量":"366"}, { "交易日期":"103.06.25","作物代號":"P3","作物名稱":"番石榴-帝王芭","市場代號":"241","市場名稱":"三重市","上價":"58","中價":"52.7","下價":"18","平均價":"46.8","交易量":"100"}, { "交易日期":"103.06.25","作物代號":"P5","作物名稱":"番石榴-水晶無仔","市場代號":"241","市場名稱":"三重市","上價":"37","中價":"35","下價":"28.8","平均價":"34.1","交易量":"192"}, { "交易日期":"103.06.25","作物代號":"Q1","作物名稱":"蓮霧-紅蓮霧","市場代號":"241","市場名稱":"三重市","上價":"30.2","中價":"26.8","下價":"18.1","平均價":"25.7","交易量":"3189"}, { "交易日期":"103.06.25","作物代號":"Q4","作物名稱":"蓮霧-巴掌蓮霧","市場代號":"241","市場名稱":"三重市","上價":"52","中價":"52","下價":"52","平均價":"52","交易量":"96"}, { "交易日期":"103.06.25","作物代號":"R0","作物名稱":"芒果-其他","市場代號":"241","市場名稱":"三重市","上價":"39","中價":"24.3","下價":"19.9","平均價":"26.4","交易量":"2316"}, { "交易日期":"103.06.25","作物代號":"R1","作物名稱":"芒果-愛文","市場代號":"241","市場名稱":"三重市","上價":"79.5","中價":"45.2","下價":"32.8","平均價":"49.6","交易量":"25296"}, { "交易日期":"103.06.25","作物代號":"R2","作物名稱":"芒果-紅龍玉文","市場代號":"241","市場名稱":"三重市","上價":"43.9","中價":"28.4","下價":"23.5","平均價":"30.5","交易量":"10257"}, { "交易日期":"103.06.25","作物代號":"R3","作物名稱":"芒果-本島","市場代號":"241","市場名稱":"三重市","上價":"91.5","中價":"38.8","下價":"36.6","平均價":"48.9","交易量":"599"}, { "交易日期":"103.06.25","作物代號":"R5","作物名稱":"芒果-黑香金興","市場代號":"241","市場名稱":"三重市","上價":"78.7","中價":"57.9","下價":"42","平均價":"58.9","交易量":"557"}, { "交易日期":"103.06.25","作物代號":"R6","作物名稱":"芒果-金煌","市場代號":"241","市場名稱":"三重市","上價":"33.9","中價":"21.4","下價":"15.6","平均價":"22.7","交易量":"19760"}, { "交易日期":"103.06.25","作物代號":"R8","作物名稱":"芒果-芒果青","市場代號":"241","市場名稱":"三重市","上價":"26.7","中價":"17","下價":"13.2","平均價":"18.2","交易量":"706"}, { "交易日期":"103.06.25","作物代號":"S0","作物名稱":"葡萄-其他","市場代號":"241","市場名稱":"三重市","上價":"12","中價":"12","下價":"12","平均價":"12","交易量":"112"}, { "交易日期":"103.06.25","作物代號":"S1","作物名稱":"葡萄-巨峰","市場代號":"241","市場名稱":"三重市","上價":"45.2","中價":"40.6","下價":"33.1","平均價":"40","交易量":"9891"}, { "交易日期":"103.06.25","作物代號":"S9","作物名稱":"葡萄-進口","市場代號":"241","市場名稱":"三重市","上價":"285.7","中價":"60","下價":"52.5","平均價":"103.6","交易量":"2256"}, { "交易日期":"103.06.25","作物代號":"SA9","作物名稱":"蘿蔔-進口","市場代號":"241","市場名稱":"三重市","上價":"17","中價":"16.6","下價":"13.7","平均價":"16.1","交易量":"1400"}, { "交易日期":"103.06.25","作物代號":"SB1","作物名稱":"胡蘿蔔-未洗","市場代號":"241","市場名稱":"三重市","上價":"9","中價":"9","下價":"9","平均價":"9","交易量":"300"}, { "交易日期":"103.06.25","作物代號":"SB2","作物名稱":"胡蘿蔔-清洗","市場代號":"241","市場名稱":"三重市","上價":"7","中價":"7","下價":"5.6","平均價":"6.7","交易量":"2620"}, { "交易日期":"103.06.25","作物代號":"SC1","作物名稱":"馬鈴薯-本產","市場代號":"241","市場名稱":"三重市","上價":"21.5","中價":"15.1","下價":"10","平均價":"15.4","交易量":"672"}, { "交易日期":"103.06.25","作物代號":"SD1","作物名稱":"洋蔥-本產","市場代號":"241","市場名稱":"三重市","上價":"19.1","中價":"15.1","下價":"12.6","平均價":"15.4","交易量":"1425"}, { "交易日期":"103.06.25","作物代號":"SE1","作物名稱":"青蔥-日蔥","市場代號":"241","市場名稱":"三重市","上價":"30","中價":"30","下價":"30","平均價":"30","交易量":"100"}, { "交易日期":"103.06.25","作物代號":"SE6","作物名稱":"青蔥-粉蔥","市場代號":"241","市場名稱":"三重市","上價":"33.7","中價":"29.5","下價":"23.2","平均價":"29.1","交易量":"2093"}, { "交易日期":"103.06.25","作物代號":"SF1","作物名稱":"韭菜-白頭","市場代號":"241","市場名稱":"三重市","上價":"7","中價":"5.7","下價":"3","平均價":"5.4","交易量":"33"}, { "交易日期":"103.06.25","作物代號":"SF3","作物名稱":"韭菜-韭菜花","市場代號":"241","市場名稱":"三重市","上價":"25","中價":"19.8","下價":"18","平均價":"20.5","交易量":"42"}, { "交易日期":"103.06.25","作物代號":"SF4","作物名稱":"韭菜-青頭","市場代號":"241","市場名稱":"三重市","上價":"31.9","中價":"26.2","下價":"25","平均價":"27.1","交易量":"93"}, { "交易日期":"103.06.25","作物代號":"SG5","作物名稱":"大蒜-蒜頭","市場代號":"241","市場名稱":"三重市","上價":"35","中價":"32.9","下價":"22.5","平均價":"31.2","交易量":"118"}, { "交易日期":"103.06.25","作物代號":"SH1","作物名稱":"竹筍-麻竹筍","市場代號":"241","市場名稱":"三重市","上價":"26.2","中價":"18.3","下價":"13.9","平均價":"19","交易量":"2187"}, { "交易日期":"103.06.25","作物代號":"SH2","作物名稱":"竹筍-綠竹筍","市場代號":"241","市場名稱":"三重市","上價":"69.5","中價":"40.4","下價":"23.4","平均價":"42.8","交易量":"818"}, { "交易日期":"103.06.25","作物代號":"SH5","作物名稱":"竹筍-烏殼綠","市場代號":"241","市場名稱":"三重市","上價":"21.5","中價":"15.6","下價":"8.4","平均價":"15.3","交易量":"921"}, { "交易日期":"103.06.25","作物代號":"SJ1","作物名稱":"芋-麵芋","市場代號":"241","市場名稱":"三重市","上價":"10","中價":"10","下價":"10","平均價":"10","交易量":"25"}, { "交易日期":"103.06.25","作物代號":"SJ2","作物名稱":"芋-檳榔心芋","市場代號":"241","市場名稱":"三重市","上價":"45","中價":"34.1","下價":"16.6","平均價":"32.8","交易量":"404"}, { "交易日期":"103.06.25","作物代號":"SJ4","作物名稱":"芋-芋莖","市場代號":"241","市場名稱":"三重市","上價":"8","中價":"8","下價":"8","平均價":"8","交易量":"20"}, { "交易日期":"103.06.25","作物代號":"SM1","作物名稱":"牛蒡","市場代號":"241","市場名稱":"三重市","上價":"26","中價":"26","下價":"26","平均價":"26","交易量":"150"}, { "交易日期":"103.06.25","作物代號":"SO1","作物名稱":"甘薯-改良種","市場代號":"241","市場名稱":"三重市","上價":"28","中價":"18.7","下價":"11.5","平均價":"19.1","交易量":"250"}, { "交易日期":"103.06.25","作物代號":"SO3","作物名稱":"甘藷-臺農66號","市場代號":"241","市場名稱":"三重市","上價":"29.3","中價":"24.2","下價":"16.8","平均價":"23.8","交易量":"300"}, { "交易日期":"103.06.25","作物代號":"SP1","作物名稱":"薑-老薑","市場代號":"241","市場名稱":"三重市","上價":"110","中價":"107.5","下價":"105","平均價":"107.5","交易量":"60"}, { "交易日期":"103.06.25","作物代號":"SP2","作物名稱":"薑-嫩薑","市場代號":"241","市場名稱":"三重市","上價":"57.8","中價":"52.8","下價":"46","平均價":"52.4","交易量":"720"}, { "交易日期":"103.06.25","作物代號":"SQ1","作物名稱":"茭白筍-帶殼","市場代號":"241","市場名稱":"三重市","上價":"61.6","中價":"55","下價":"43.8","平均價":"54.1","交易量":"480"}, { "交易日期":"103.06.25","作物代號":"SQ3","作物名稱":"茭白筍-去殼","市場代號":"241","市場名稱":"三重市","上價":"84.9","中價":"79.6","下價":"64.3","平均價":"77.6","交易量":"189"}, { "交易日期":"103.06.25","作物代號":"SU2","作物名稱":"薯蕷-白薯蕷","市場代號":"241","市場名稱":"三重市","上價":"45.6","中價":"32.4","下價":"17.6","平均價":"32.1","交易量":"279"}, { "交易日期":"103.06.25","作物代號":"SV9","作物名稱":"蘆筍-進口","市場代號":"241","市場名稱":"三重市","上價":"77.2","中價":"54.6","下價":"50","平均價":"58.2","交易量":"97"}, { "交易日期":"103.06.25","作物代號":"SX3","作物名稱":"芽菜類-豌豆嬰","市場代號":"241","市場名稱":"三重市","上價":"25","中價":"25","下價":"25","平均價":"25","交易量":"9"}, { "交易日期":"103.06.25","作物代號":"SX4","作物名稱":"芽菜類-苜宿芽","市場代號":"241","市場名稱":"三重市","上價":"20","中價":"20","下價":"20","平均價":"20","交易量":"4"}, { "交易日期":"103.06.25","作物代號":"T1","作物名稱":"西瓜-大西瓜","市場代號":"241","市場名稱":"三重市","上價":"8","中價":"8","下價":"8","平均價":"8","交易量":"130110"}, { "交易日期":"103.06.25","作物代號":"T5","作物名稱":"西瓜-黃肉","市場代號":"241","市場名稱":"三重市","上價":"13.8","中價":"9.3","下價":"7.8","平均價":"9.9","交易量":"12686"}, { "交易日期":"103.06.25","作物代號":"T7","作物名稱":"西瓜-秀鈴","市場代號":"241","市場名稱":"三重市","上價":"16.9","中價":"12.7","下價":"10.7","平均價":"13.1","交易量":"2767"}, { "交易日期":"103.06.25","作物代號":"V1","作物名稱":"甜瓜-美濃","市場代號":"241","市場名稱":"三重市","上價":"42.7","中價":"25.9","下價":"10.8","平均價":"26.3","交易量":"5124"}, { "交易日期":"103.06.25","作物代號":"V2","作物名稱":"甜瓜-溫室吊瓜","市場代號":"241","市場名稱":"三重市","上價":"67","中價":"57.9","下價":"52.2","平均價":"58.6","交易量":"2136"}, { "交易日期":"103.06.25","作物代號":"W1","作物名稱":"洋香瓜-網狀紅肉","市場代號":"241","市場名稱":"三重市","上價":"26.3","中價":"21.9","下價":"18","平均價":"22","交易量":"6150"}, { "交易日期":"103.06.25","作物代號":"W2","作物名稱":"洋香瓜-網狀綠肉","市場代號":"241","市場名稱":"三重市","上價":"112.2","中價":"42.7","下價":"16.7","平均價":"51.4","交易量":"1132"}, { "交易日期":"103.06.25","作物代號":"X49","作物名稱":"蘋果-金冠(進口)","市場代號":"241","市場名稱":"三重市","上價":"110","中價":"110","下價":"110","平均價":"110","交易量":"150"}, { "交易日期":"103.06.25","作物代號":"X69","作物名稱":"蘋果-富士(進口)","市場代號":"241","市場名稱":"三重市","上價":"93.3","中價":"65","下價":"57.2","平均價":"69.1","交易量":"28130"}, { "交易日期":"103.06.25","作物代號":"Y1","作物名稱":"桃子-水蜜桃","市場代號":"241","市場名稱":"三重市","上價":"73","中價":"67","下價":"65","平均價":"67.8","交易量":"837"}, { "交易日期":"103.06.25","作物代號":"Y19","作物名稱":"水蜜桃-進口","市場代號":"241","市場名稱":"三重市","上價":"110","中價":"108","下價":"108","平均價":"108.4","交易量":"50"}, { "交易日期":"103.06.25","作物代號":"Y2","作物名稱":"桃子-鶯歌桃","市場代號":"241","市場名稱":"三重市","上價":"19.7","中價":"16.3","下價":"14.4","平均價":"16.6","交易量":"1016"}, { "交易日期":"103.06.25","作物代號":"Y39","作物名稱":"甜桃-甜桃進口","市場代號":"241","市場名稱":"三重市","上價":"150","中價":"114.4","下價":"108.5","平均價":"120.3","交易量":"5450"}, { "交易日期":"103.06.25","作物代號":"Y5","作物名稱":"桃子-福壽桃","市場代號":"241","市場名稱":"三重市","上價":"15","中價":"15","下價":"15","平均價":"15","交易量":"22"}, { "交易日期":"103.06.25","作物代號":"Y9","作物名稱":"桃子-進口","市場代號":"241","市場名稱":"三重市","上價":"289.4","中價":"211.8","下價":"110","平均價":"207","交易量":"4089"} ]';
$data = json_decode($json, true);
$result = array();
$keymap = array();
foreach ($data as $item) {
    $pos = strpos($item['作物名稱'], '-');
    if ($pos === false) {
        $cat = $item['作物名稱'];
        //$result[$cat] = array();
    } else {
        $cat = substr($item['作物名稱'], 0, $pos);
    }
    if (!isset($keymap[$cat])) {
        $result[] = array('name' => $cat, 'children' => array());
        $keymap[$cat] = (count($result) - 1);
    }
    //echo $keymap[$cat];
    $result[$keymap[$cat]]['children'][] = array('name' => $item['作物名稱'], 'quantity' => $item['交易量'], 'price' => $item['平均價']);
}
//echo json_encode(array('name' => 'data', 'children' => $result));
?>

<form>
    <label><input type="radio" name="mode" value="amount"> 價量</label>
    <label><input type="radio" name="mode" value="quantity"> 交易量</label>
    <label><input type="radio" name="mode" value="count" checked> 種類</label>
</form>
<script src="http://d3js.org/d3.v3.min.js"></script>
<script>
    var width = 960,
            height = 700,
            radius = Math.min(width, height) / 2,
            color = d3.scale.category20c();

    var x = d3.scale.linear()
            .range([0, 2 * Math.PI]);

    var y = d3.scale.linear()
            .range([0, radius]);

    var svg = d3.select("body").append("svg")
            .attr("width", width)
            .attr("height", height)
            .append("g")
            .attr("transform", "translate(" + width / 2 + "," + (height / 2 + 10) + ")");

    var partition = d3.layout.partition()
            .value(function(d) {
                return d.quantity;
            });

    var arc = d3.svg.arc()
            .startAngle(function(d) {
                return Math.max(0, Math.min(2 * Math.PI, x(d.x)));
            })
            .endAngle(function(d) {
                return Math.max(0, Math.min(2 * Math.PI, x(d.x + d.dx)));
            })
            .innerRadius(function(d) {
                return Math.max(0, y(d.y));
            })
            .outerRadius(function(d) {
                return Math.max(0, y(d.y + d.dy));
            });

    d3.json("../data.json", function(error, root) {
//        var path = svg.datum(root).selectAll("path")
//                .data(partition.nodes)
//                .enter().append("path")
//                .attr("display", function(d) {
//                    return d.depth ? null : "none";
//                }) // hide inner ring
//                .attr("d", arc)
//                .style("stroke", "#fff")
//                .style("fill", function(d) {
//                    return color((d.children ? d : d.parent).name);
//                })
//                .style("fill-rule", "evenodd")
//                .each(stash).on("click", click);

//        var g = svg.datum(root).selectAll("path")
//                .data(partition.nodes)
//                .enter();
//
//        var path = g.append("path")
//                .attr("display", function(d) {
//                    return d.depth ? null : "none";
//                }) // hide inner ring
//                .attr("d", arc)
//                .style("stroke", "#fff")
//                .style("fill", function(d) {
//                    return color((d.children ? d : d.parent).name);
//                })
//                .style("fill-rule", "evenodd")
//                .each(stash)
//                .on("click", click);
        var g = svg.selectAll("g")
                .data(partition.nodes(root))
                .enter().append("g");

        var path = g.append("path")
                .attr("d", arc)
                .style("stroke", "#fff")
                .style("fill", function(d) {
                    return color((d.children ? d : d.parent).name);
                })
                .style("fill-rule", "evenodd")
                .each(stash)
                .on("click", click);

        var text = g.append("text")
                .attr("transform", function(d) {
                    return "rotate(" + computeTextRotation(d) + ")";
                })
                .attr("x", function(d) {
                    return y(d.y);
                })
                .attr("dx", "6") // margin
                .attr("dy", ".35em") // vertical-align
                .text(function(d) {
                    return d.name;
                });

        function click(d) {
            // fade out all text elements
            text.transition().attr("opacity", 0);

            path.transition()
                    .duration(750)
                    .attrTween("d", arcTween(d))
                    .each("end", function(e, i) {
                        // check if the animated element's data e lies within the visible angle span given in d
                        if (e.x >= d.x && e.x < (d.x + d.dx)) {
                            // get a selection of the associated text element
                            var arcText = d3.select(this.parentNode).select("text");
                            // fade in the text element and recalculate positions
                            arcText.transition().duration(750)
                                    .attr("opacity", 1)
                                    .attr("transform", function() {
                                        return "rotate(" + computeTextRotation(e) + ")"
                                    })
                                    .attr("x", function(d) {
                                        return y(d.y);
                                    });
                        }
                    });
        }

        d3.selectAll("input").on("change", function change() {
            var value;
            switch (this.value) {
                case 'amount':
                    value = function(d) {
                        return d.price * d.quantity;
                    };
                    break;
                case 'quantity':
                    value = function(d) {
                        return d.quantity;
                    };
                    break;
                default:
                    value = function() {
                        return 1;
                    };
                    break;
            }

            path.data(partition.value(value).nodes)
                    .transition()
                    .duration(1500)
                    .attrTween("d", arcTween);
        });
    });

    // Stash the old values for transition.
    function stash(d) {
        d.x0 = d.x;
        d.dx0 = d.dx;
    }
//
//    // Interpolate the arcs in data space.
//    function arcTween(a) {
//        var i = d3.interpolate({x: a.x0, dx: a.dx0}, a);
//        return function(t) {
//            var b = i(t);
//            a.x0 = b.x;
//            a.dx0 = b.dx;
//            return arc(b);
//        };
//    }

    // Interpolate the scales!
    function arcTween(d) {
        var xd = d3.interpolate(x.domain(), [d.x, d.x + d.dx]),
                yd = d3.interpolate(y.domain(), [d.y, 1]),
                yr = d3.interpolate(y.range(), [d.y ? 20 : 0, radius]);
        return function(d, i) {
            return i
                    ? function(t) {
                        return arc(d);
                    }
            : function(t) {
                x.domain(xd(t));
                y.domain(yd(t)).range(yr(t));
                return arc(d);
            };
        };
    }


    function computeTextRotation(d) {
        var angle = x(d.x + d.dx / 2) - Math.PI / 2;
        return angle / Math.PI * 180;
    }

    d3.select(self.frameElement).style("height", height + "px");

//    d3.json("../data.json", function(error, root) {
//        var path = svg.selectAll("path")
//                .data(partition.nodes(root))
//                .enter().append("path")
//                .attr("d", arc)
//                .style("fill", function(d) {
//                    return color((d.children ? d : d.parent).name);
//                })
//                .on("click", click);
//
//    });

</script>